{
  "\n": 13, 
  "\r": 82, 
  " ": 0, 
  "!": 66, 
  "\"": 30, 
  "#": 156, 
  "%": 174, 
  "&": 115, 
  "'": 61, 
  "(": 86, 
  ")": 87, 
  "*": 124, 
  "+": 122, 
  ",": 21, 
  "-": 54, 
  ".": 20, 
  "/": 119, 
  "0": 77, 
  "1": 41, 
  "2": 47, 
  "3": 53, 
  "4": 56, 
  "5": 60, 
  "6": 63, 
  "7": 65, 
  "8": 70, 
  "9": 74, 
  ":": 59, 
  ";": 62, 
  "=": 176, 
  "?": 28, 
  "@": 149, 
  "A": 32, 
  "B": 42, 
  "C": 39, 
  "D": 44, 
  "E": 38, 
  "F": 68, 
  "G": 51, 
  "H": 37, 
  "I": 27, 
  "J": 71, 
  "K": 67, 
  "L": 58, 
  "M": 36, 
  "N": 40, 
  "O": 46, 
  "P": 52, 
  "Q": 84, 
  "R": 48, 
  "S": 31, 
  "T": 26, 
  "U": 81, 
  "V": 69, 
  "W": 33, 
  "X": 76, 
  "Y": 45, 
  "Z": 55, 
  "[": 73, 
  "]": 72, 
  "_": 106, 
  "a": 3, 
  "b": 23, 
  "c": 17, 
  "d": 10, 
  "e": 1, 
  "f": 18, 
  "g": 15, 
  "h": 8, 
  "i": 6, 
  "j": 49, 
  "k": 24, 
  "l": 11, 
  "m": 14, 
  "n": 4, 
  "o": 5, 
  "p": 22, 
  "q": 57, 
  "r": 9, 
  "s": 7, 
  "t": 2, 
  "u": 12, 
  "v": 25, 
  "w": 19, 
  "x": 50, 
  "y": 16, 
  "z": 43, 
  "\u00a0": 109, 
  "\u00a1": 137, 
  "\u00a8": 104, 
  "\u00a9": 138, 
  "\u00af": 118, 
  "\u00b4": 158, 
  "\u00d4": 116, 
  "\u00e0": 89, 
  "\u00e1": 83, 
  "\u00e3": 112, 
  "\u00e8": 164, 
  "\u00e9": 94, 
  "\u00ec": 100, 
  "\u00ed": 110, 
  "\u00ef": 128, 
  "\u00f1": 98, 
  "\u00f2": 111, 
  "\u00f3": 108, 
  "\u00f4": 75, 
  "\u00f9": 107, 
  "\u00fa": 95, 
  "\u00fb": 92, 
  "\u0100": 125, 
  "\u0101": 79, 
  "\u0103": 102, 
  "\u0113": 121, 
  "\u011b": 117, 
  "\u012b": 91, 
  "\u0131": 157, 
  "\u0144": 96, 
  "\u014d": 64, 
  "\u014f": 97, 
  "\u015a": 105, 
  "\u015b": 88, 
  "\u016b": 85, 
  "\u016d": 93, 
  "\u01ce": 120, 
  "\u01d0": 163, 
  "\u01d4": 126, 
  "\u02dc": 161, 
  "\u0308": 166, 
  "\u1e43": 113, 
  "\u1e47": 99, 
  "\u2000": 103, 
  "\u2010": 146, 
  "\u2012": 167, 
  "\u2013": 90, 
  "\u2014": 78, 
  "\u2018": 80, 
  "\u2019": 29, 
  "\u201c": 34, 
  "\u201d": 35, 
  "\u2026": 114, 
  "\u2028": 101, 
  "\u3124": 168, 
  "\u4e00": 127, 
  "\u4e03": 152, 
  "\u4e09": 140, 
  "\u4e8c": 132, 
  "\u4e94": 155, 
  "\u4ea6": 175, 
  "\u4f55": 160, 
  "\u4f7f": 178, 
  "\u516b": 172, 
  "\u516d": 173, 
  "\u52e4": 162, 
  "\u5341": 123, 
  "\u534d": 159, 
  "\u53f0": 145, 
  "\u56db": 129, 
  "\u57c3": 141, 
  "\u5875": 143, 
  "\u593e": 148, 
  "\u5982": 153, 
  "\u5fc3": 170, 
  "\u60f9": 135, 
  "\u62c2": 177, 
  "\u62ed": 154, 
  "\u63d0": 144, 
  "\u660e": 136, 
  "\u662f": 151, 
  "\u6642": 142, 
  "\u672c": 139, 
  "\u6a39": 133, 
  "\u7121": 134, 
  "\u7269": 171, 
  "\u83ab": 169, 
  "\u83e9": 131, 
  "\u8655": 165, 
  "\u8eab": 147, 
  "\u93e1": 130, 
  "\u975e": 150
}