{
  "\n": 13,
  " ": 0,
  "!": 63,
  "\"": 38,
  "%": 164,
  "&": 112,
  "'": 70,
  "(": 93,
  ")": 94,
  "*": 123,
  "+": 124,
  ",": 21,
  "-": 59,
  ".": 18,
  "/": 117,
  "0": 76,
  "1": 41,
  "2": 46,
  "3": 53,
  "4": 55,
  "5": 57,
  "6": 61,
  "7": 62,
  "8": 65,
  "9": 73,
  ":": 67,
  ";": 68,
  "?": 28,
  "@": 141,
  "A": 33,
  "B": 42,
  "C": 40,
  "D": 44,
  "E": 36,
  "F": 66,
  "G": 52,
  "H": 39,
  "I": 27,
  "J": 69,
  "K": 71,
  "L": 58,
  "M": 35,
  "N": 37,
  "O": 47,
  "P": 51,
  "Q": 85,
  "R": 49,
  "S": 32,
  "T": 26,
  "U": 78,
  "V": 64,
  "W": 34,
  "X": 74,
  "Y": 45,
  "Z": 54,
  "[": 79,
  "]": 80,
  "_": 104,
  "a": 3,
  "b": 23,
  "c": 16,
  "d": 10,
  "e": 1,
  "f": 19,
  "g": 15,
  "h": 8,
  "i": 6,
  "j": 48,
  "k": 24,
  "l": 11,
  "m": 14,
  "n": 4,
  "o": 5,
  "p": 22,
  "q": 56,
  "r": 9,
  "s": 7,
  "t": 2,
  "u": 12,
  "v": 25,
  "w": 20,
  "x": 50,
  "y": 17,
  "z": 43,
  "\u00a0": 106,
  "\u00d4": 113,
  "\u00e0": 86,
  "\u00e1": 81,
  "\u00e3": 111,
  "\u00e8": 163,
  "\u00e9": 91,
  "\u00ec": 99,
  "\u00ed": 107,
  "\u00ef": 122,
  "\u00f1": 97,
  "\u00f2": 109,
  "\u00f3": 108,
  "\u00f4": 72,
  "\u00f9": 105,
  "\u00fa": 92,
  "\u00fb": 89,
  "\u0100": 119,
  "\u0101": 77,
  "\u0103": 101,
  "\u0113": 116,
  "\u011b": 114,
  "\u012b": 87,
  "\u0144": 95,
  "\u014d": 60,
  "\u014f": 96,
  "\u015a": 103,
  "\u015b": 84,
  "\u016b": 83,
  "\u016d": 90,
  "\u01ce": 115,
  "\u01d0": 165,
  "\u01d4": 120,
  "\u1e43": 110,
  "\u1e47": 98,
  "\u2000": 102,
  "\u2012": 140,
  "\u2013": 88,
  "\u2014": 75,
  "\u2018": 82,
  "\u2019": 31,
  "\u201c": 29,
  "\u201d": 30,
  "\u2028": 100,
  "\u3124": 147,
  "\u4e00": 121,
  "\u4e03": 145,
  "\u4e09": 126,
  "\u4e8c": 125,
  "\u4e94": 143,
  "\u4ea6": 157,
  "\u4f55": 161,
  "\u4f7f": 156,
  "\u516b": 146,
  "\u516d": 144,
  "\u52e4": 152,
  "\u5341": 118,
  "\u534d": 142,
  "\u53f0": 133,
  "\u56db": 127,
  "\u57c3": 137,
  "\u5875": 136,
  "\u593e": 159,
  "\u5982": 151,
  "\u5fc3": 150,
  "\u60f9": 135,
  "\u62c2": 153,
  "\u62ed": 154,
  "\u63d0": 129,
  "\u660e": 131,
  "\u662f": 149,
  "\u6642": 134,
  "\u672c": 138,
  "\u6a39": 130,
  "\u7121": 139,
  "\u7269": 160,
  "\u83ab": 155,
  "\u83e9": 128,
  "\u8655": 162,
  "\u8eab": 148,
  "\u93e1": 132,
  "\u975e": 158
}